{
  "experience": [
    {
      "period": "Now",
      "work": [
        {
          "title": "881903.com",
          "context": "Commercial Radio main site has just been revamped last year involving data migration, server setup, web frontend, content management system, etc.",
          "images": [
            "881903-1.png",
            "881903-2.png",
            "881903-3.png",
            "881903-4.png",
            "881903-5.png",
            "881903-6.png",
            "881903-7.png"
          ],
          "url": "https://www.881903.com",
          "tech": [
            "VueJS",
            "Vuex",
            "PHP",
            "Phalcon",
            "Nginx",
            "Google Tag Manager"
          ],
          "task": [
            {
              "title": "新聞/財經及馬路的事",
              "context": "I am in charge of 熱門新聞 (新聞HomePage), all frontend and backend part. Workers are created to generate snapshots of latest 10 items for different purposes. "
            },
            {
              "title": "節目表",
              "context": "The task is to create a real-time timetable in accord to 881903 CMS content. The timetable is able to update schedule by itself even in idle."
            },
            {
              "title": "881903會員",
              "context": "The membership feature includes registration, profile update, phone number verification, membership purchase, etc."
            },
            {
              "title": "News Feed Worker",
              "context": "The worker is to retrieve 24 hours news and generate RSS or XML file every 10 minutes for social platform like Line and NOW to deliver news feeds on their mobile applications or websites."
            },
            {
              "title": "Custom Creative Template for Google Admanager",
              "context": "Add a crazy ad with self-coded creative template to deliver whatever-you-want ad on the site"
            }
          ]
        },
        {
          "title": "髮再生",
          "context": "A campaign from 髮再生 including a home page with one HTML5 Audio player, two forms for user to registration hair therapy and story sharing. A worker is written to send all new records of registration and story to client at 12pm. Email was sent with PHP Email<br><br><strong>NOT YET LAUNCHED</strong>",
          "images": [
            "hairagain-1.png",
            "hairagain-2.png",
            "hairagain-3.png",
            "hairagain-4.png"
          ],
          "tech": [
            "VueJS",
            "PHP",
            "PHP PDO"
          ]
        },
        {
          "title": "摯愛動心 Citigold 做得島",
          "context": "A campaign working with Citibank, 881903 and GuruOnline. Citibank is the major host of the project. I, representing 881903, was in charge of game flow. And GuruOnline is responsible for quota control, API for checking user and quota and data collection. The game was developed with VueJS and Facebook authentication. Axios is used to call GuruOnline API requests.",
          "images": [
            "citibank-1.png"
          ],
          "url": "https://citibank2020.881903.com/",
          "tech": [
            "VueJS",
            "Vuex",
            "PHP",
            "Facebook Login / OAuth"
          ],
          "task": [
            {
              "title": "Facebook Login / OAuth",
              "context": "Facebook for developer console requires inserting app domains and privacy policy url to enable application being active. Facebook Login is one of the products chosen for the console. It requires Valid OAuth Redirect URIs which is Facebook Login callback, e.g. http://citibank2020.881903.com/fb"
            },
            {
              "title": "API from GuruOnline testing with Postman"
            }
          ]
        },
        {
          "title": "我們的60年 - 商業電台經典重溫",
          "context": "A campaign site to celebrate CR881903 60th anniversary. It is similar to 881903.com 視電台 but without <strong>jQuery</strong> and <strong>Youtube Data API</strong>. The site uses HTML5 Video in place of Youtube iframe. Sound files and JSON files are provided by project managers on mount drive. A worker is written to sync media and JSON files. The site gets media file via symbolic links.",
          "images": ["cr60-1.png"],
          "url": "https://campaign.881903.com/CR60_ClassicPrograms/index.php",
          "tech": [
            "PHP",
            "Gulp",
            "Google Tag Manager",
            "DoubleClick for Publisher (DFP)",
            "Interactive Media Ads (IMA)"
          ]
        },
        {
          "title": "881903.com 視電台",
          "context": "A website deeply rely on 881903.com Youtube Channel. No database is involved. The whole application uses Youtube Data API to mimic Youtube interface including get playlist item (video) snippets, statistic (view count, like count). And a heavy implementation of DoubleClick for Publisher (DFP) and Interactive Media Ads (IMA) aiming to earn more revenue",
          "images": [
            "crtv-1.png",
            "crtv-2.png",
            "crtv-3.png"
          ],
          "url": "http://crtv.881903.com/",
          "tech": [
            "PHP",
            "Gulp",
            "jQuery 3",
            "Google Tag Manager",
            "DoubleClick for Publisher (DFP)",
            "Interactive Media Ads (IMA)"
          ],
          "task": [
            {
              "title": "Youtube Data API",
              "context": "The application data request was done with PHP at first but it requires quota counts. It changes to using Ajax at the end because no quota limit is set."
            },
            {
              "title": "DoubleClick for Publisher (DFP)",
              "context": "DFP are loaded with lazy load configs later due to project team reported that ad impression did not look good"
            },
            {
              "title": "Interactive Media Ads (IMA)",
              "context": "Youtube embed iframe does not provide Google Ads Service. The implementation is to call Youtube Iframe API to initiate the iframe but inserting (on-top-of-video) a pre-roll VAST or VPAID ads before playing the loaded Youtube video."
            }
          ]
        }
      ]
    },
    {
      "period": "2014 - 2017",
      "work": [
        {
          "title": "WSD",
          "context": ""
        },
        {
          "title": "EMSD",
          "context": ""
        },
        {
          "title": "FEHD",
          "context": ""
        },
        {
          "title": "HongKongPost",
          "context": ""
        },
        {
          "title": "PolyU Main Site",
          "context": ""
        },
        {
          "title": "“無盡思念”網站流動應用程式",
          "context": "",
          "tech": [
            "Cordova"
          ]
        }
      ]
    },
    {
      "period": "2013 - 2014",
      "work": [
        {
          "title": "Student Helper",
          "context": "Develop a mobile application with PhoneGap to promote conservation of the sea and its organisms. <br>Design wireframes and create artwork for the application"
        }
      ]
    }
  ]
}
